In [94]:
!jt -t solarizedl -T -N -kl

Ofloxacin and Ornidazole ---->Loose motion
Fenceta Nova           ---->fever and pain
Cifran 250 ----->antibiotic(fever and gaav sukhane ke kaam )
Resteclin 500 (antibiotic)----->(fever and gaav sukhane ke kaam )#k
Dolo 500 (paracetomol)
Grilints-vm ----------->(Khansi(cough))
Carval plus ----------->(for sardi bhaaf lena hai)
Chestan cold ---------->(Anti cold tablet ,for sardi and fever)
Perinorm -------------->(for vomiting)

pandas:
    >It is python package that represents STRUCTURED DATA with labels(columns) and 
        index(row)
    >It is used in DATA ANALYTICS and DATA PREPROCESSING for ML
Dataframe:
    >It is used to store 2-D STRUCTURED DATA with labels and index
Series:
   >It is used to store 1-d data(more specifically each column in Dataframe
        is an object of  Series type)
Why name pandas?
----------------
    >Basically this word was derived from word PANEL DATA i.e pan + da
panel data:
    >Data of an organization/individual/domain generated over a period of 
        time

In [60]:
import pandas as pd
df=pd.DataFrame()

In [61]:
type(df)

pandas.core.frame.DataFrame

In [62]:
df.size

0

In [63]:
df=pd.DataFrame([[101,'sonu',700],[102,'monu',670]]) # It acceps iterable,dictionary,n-d array,dataframe
df

     0     1    2
0  101  sonu  700
1  102  monu  670

index == row
labels == column

In [64]:
df=pd.DataFrame([[101,'sonu',700],[102,'monu',670]],columns=[10,20,30])
df

    10    20   30
0  101  sonu  700
1  102  monu  670

In [65]:
df=pd.DataFrame([[101,'sonu',700],[102,'monu',670]],
                columns=['Roll_no','Name','Marks_of_exam'])#explicitly assigning the columns
df

   Roll_no  Name  Marks_of_exam
0      101  sonu            700
1      102  monu            670

In [66]:
df=pd.DataFrame([[101,'sonu',700],[102,'monu',670]],
                columns=['Roll_no','Name','Marks_of_exam'],
                index=['row1','row2'])#explicitly assigning the columns and indexes
df

      Roll_no  Name  Marks_of_exam
row1      101  sonu            700
row2      102  monu            670

# Missing Values

In [67]:
# NaN == missing values
df=pd.DataFrame([[101,'sonu',700],[102,'monu']],
                columns=['Roll_no','Name','Marks_of_exam'],
                index=['zero','one'])#explicitly assigning the columns
df

      Roll_no  Name  Marks_of_exam
zero      101  sonu          700.0
one       102  monu            NaN

# Method-2 to create the DataFrame using the dictionary

In [68]:
df=pd.DataFrame({'Roll_no':[101,102,103],'Name':['sonu','monu','rahul'],
                 'marks':[345,346,390]})
df

   Roll_no   Name  marks
0      101   sonu    345
1      102   monu    346
2      103  rahul    390

In [69]:
df=pd.DataFrame({'Roll_no':[2117620170039],'Name':['Pankaj Jaiswal'],'marks':[99]}) # Here you have to pass the value in the form of list otherwiese it will raise error
df

         Roll_no            Name  marks
0  2117620170039  Pankaj Jaiswal     99

df=pd.DataFrame({'Roll_no':[101,102,103],'Name':['sonu','monu'],
                 'marks':[345,346,390]})#if length of the any of the array is less than other arrays then it will give ValueError
df

In [70]:
df=pd.DataFrame({'Roll_no':[101,102,103],'Name':['sonu','monu','rahul'],
                 'marks':[349,346,390]})
df

   Roll_no   Name  marks
0      101   sonu    349
1      102   monu    346
2      103  rahul    390

In [71]:
# df.insert(column_position,column_name,column_value)--->inplace
df.insert(3,'college',['college1','college2','college3'])
df

   Roll_no   Name  marks   college
0      101   sonu    349  college1
1      102   monu    346  college2
2      103  rahul    390  college3

In [72]:
#Add a column in the last or replace existing column
#df['new_column']=values
df['age']=[20,40,44] # when we assign a column value then the column will be replaced or new column will be created like dictionary
df

   Roll_no   Name  marks   college  age
0      101   sonu    349  college1   20
1      102   monu    346  college2   40
2      103  rahul    390  college3   44

In [73]:
#Add a column in the last or replace existing column
#df['new_column']=values
df['age']=[20,40,'hello']# <-------------------------------------------
df

   Roll_no   Name  marks   college    age
0      101   sonu    349  college1     20
1      102   monu    346  college2     40
2      103  rahul    390  college3  hello

In [74]:
df['college']=['c1','c2','c3']
df

   Roll_no   Name  marks college    age
0      101   sonu    349      c1     20
1      102   monu    346      c2     40
2      103  rahul    390      c3  hello

                    |      |numpy|pandas|
----------->axis    |row   |  1  |  0   |    
                    |column|  0  |  1   |

# from here you have to revise (wednesday 07/12/2022)

In [79]:
#sort DataFrame rows or columns based on their labels and indices respectively
#axis-0 ==> row     in pandas
#axis-1 ==> columns in pandas
df.sort_index(axis=1)

    Name  Roll_no    age college  marks
0   sonu      101     20      c1    349
1   monu      102     40      c2    346
2  rahul      103  hello      c3    390

In [80]:
df.sort_index(axis=1,ascending=False)

   marks college    age  Roll_no   Name
0    349      c1     20      101   sonu
1    346      c2     40      102   monu
2    390      c3  hello      103  rahul

In [18]:
df.sort_index(axis=0)

   Roll_no   Name  marks college    age
0      101   sonu    349      c1     20
1      102   monu    346      c2     40
2      103  rahul    390      c3  hello

In [19]:
df.sort_index(axis=0,ascending=False)

   Roll_no   Name  marks college    age
2      103  rahul    390      c3  hello
1      102   monu    346      c2     40
0      101   sonu    349      c1     20

In [20]:
df.sort_values('marks')

   Roll_no   Name  marks college    age
1      102   monu    346      c2     40
0      101   sonu    349      c1     20
2      103  rahul    390      c3  hello

In [21]:
df.sort_values('marks',ascending=False)

   Roll_no   Name  marks college    age
2      103  rahul    390      c3  hello
0      101   sonu    349      c1     20
1      102   monu    346      c2     40

In [101]:
#Rearrange columns and rows
df.reindex(['Name','marks','Roll_no'],axis=1)

    Name  marks  Roll_no
0   sonu    349      101
1   monu    346      102
2  rahul    390      103

In [23]:
#How to rename column(label) or row index
df.rename({'marks':'Marks'},axis=1,inplace=True)
df

   Roll_no   Name  Marks college    age
0      101   sonu    349      c1     20
1      102   monu    346      c2     40
2      103  rahul    390      c3  hello

In [24]:
df.rename({'college':'College'},axis=1,inplace=True)
df#inplace -----> make changes in existing DataFrame and does  not create a copy

   Roll_no   Name  Marks College    age
0      101   sonu    349      c1     20
1      102   monu    346      c2     40
2      103  rahul    390      c3  hello

In [25]:
#How to delete row(index) or columns(labels)
df.drop('College',axis=1,inplace=True)#It'l give KeyError if label isn't found in the DataFrame
df
#To delete multiple columns 
    # >df.drop(['label1','label2','label3',...])

   Roll_no   Name  Marks    age
0      101   sonu    349     20
1      102   monu    346     40
2      103  rahul    390  hello

# Another way to delete the labels or index

In [26]:
del df['age']
df

   Roll_no   Name  Marks
0      101   sonu    349
1      102   monu    346
2      103  rahul    390

In [27]:
#How to get specific value of a  DataFrame
#We can use at or iat properties
#df.at[row_index,column_label]
df.at[1,'Marks']

346

In [28]:
#df.iat[row_position,column_position]
df.iat[1,2]

346

In [29]:
#How to update a specific value
#Again we may use at/iat properties
df.at[0,'marks']=850

In [30]:
df

   Roll_no   Name  Marks  marks
0      101   sonu    349  850.0
1      102   monu    346    NaN
2      103  rahul    390    NaN

In [31]:
df.iat[1,0]=201
df

   Roll_no   Name  Marks  marks
0      101   sonu    349  850.0
1      201   monu    346    NaN
2      103  rahul    390    NaN

In [32]:
#How to get a row,we may use loc/iloc properties
#df.loc[row_index]
#df.iloc[row_position]
df.loc[1]

Roll_no     201
Name       monu
Marks       346
marks       NaN
Name: 1, dtype: object

In [33]:
df.iloc[1]=[202,'montu',789,'c22']
df

   Roll_no   Name  Marks  marks
0      101   sonu    349  850.0
1      202  montu    789    c22
2      103  rahul    390    NaN

df.loc[]=.......
    >can accept both new row index or existing row index
    >if new row_index,new row is added in the last
    >if existing row index,that row is updated with new one

df.iloc[]=......
    >can accept only existing pos
    >update that row
    >error if position is out of bounds
   
==>That means iloc should be used for updates while loc is true for both

#How to get multiple rows
#Again we may use loc/iloc properties
#df.loc[start_row_index,stop_row_index:step] Note,here both are inclusive

In [34]:
df.loc[0:1]

   Roll_no   Name  Marks  marks
0      101   sonu    349  850.0
1      202  montu    789    c22

In [35]:
#df.iloc[start_row_pos:stop_row_pos:step] Note,here start is inclusive and stop is exclusive
df.iloc[0:1]

   Roll_no  Name  Marks  marks
0      101  sonu    349  850.0

In [36]:
df.loc[1:5]

   Roll_no   Name  Marks marks
1      202  montu    789   c22
2      103  rahul    390   NaN

In [37]:
df.loc[4]=[303,'gudda',670,'c12']

In [38]:
df.loc[1:4]

   Roll_no   Name  Marks marks
1      202  montu    789   c22
2      103  rahul    390   NaN
4      303  gudda    670   c12

In [39]:
df.iloc[1:]

   Roll_no   Name  Marks marks
1      202  montu    789   c22
2      103  rahul    390   NaN
4      303  gudda    670   c12

In [40]:
#How to get specific columns
#df['col_label']
#df.col_label
df['marks']

0    850.0
1      c22
2      NaN
4      c12
Name: marks, dtype: object

In [41]:
#Method-2
df.marks

0    850.0
1      c22
2      NaN
4      c12
Name: marks, dtype: object

In [42]:
df['loc']=[1,'a',500,'c21']
df

   Roll_no   Name  Marks  marks  loc
0      101   sonu    349  850.0    1
1      202  montu    789    c22    a
2      103  rahul    390    NaN  500
4      303  gudda    670    c12  c21

In [43]:
df['loc']

0      1
1      a
2    500
4    c21
Name: loc, dtype: object

In [44]:
df.loc

In [45]:
df.Roll_no

0    101
1    202
2    103
4    303
Name: Roll_no, dtype: int64

df['column_label'] vs df.column_label
    >df['column_label']----------------->always works
    >df.column_label-------------------->may fail
                >if column_label has space
                >column_labels is same as predefined property of dataframe

In [46]:
#How to get multiple columns 
#df[['column_label1','column_label2',...]]
df[['Name','marks']]

    Name  marks
0   sonu  850.0
1  montu    c22
2  rahul    NaN
4  gudda    c12

In [47]:
df[['marks','Name']]

   marks   Name
0  850.0   sonu
1    c22  montu
2    NaN  rahul
4    c12  gudda

# 8/12/2022

>How to get specific rows and columns
> -----------OR-------------
>        dataFrame slicing
>There are three ways of slicing in dataframe
    >index and label based
        df.loc[row_index_slicing,column_label_slicing]
    >position based
        df.iloc[row_position_slicing,column_position_slicing]
    >condition based
        df[condition]
        df[(condition1)&(condition2)&(condition3)&...]
        df[(condition1)|(condition2)|(condition3)|...]
>How to get specific row and columns
    >df.loc[(index1,index2,...),(label1,label2,...)]
    >df.iloc[(row_position1,row_position2,...),(column_position1,column_position2,...)

In [48]:
df

   Roll_no   Name  Marks  marks  loc
0      101   sonu    349  850.0    1
1      202  montu    789    c22    a
2      103  rahul    390    NaN  500
4      303  gudda    670    c12  c21

In [49]:
df.loc[1:4,'Name':'marks']

    Name  Marks marks
1  montu    789   c22
2  rahul    390   NaN
4  gudda    670   c12

In [50]:
df.iloc[0:3,1:4]

    Name  Marks  marks
0   sonu    349  850.0
1  montu    789    c22
2  rahul    390    NaN

In [51]:
df.loc[(4,1),('marks','Roll_no')]

  marks  Roll_no
4   c12      303
1   c22      202

In [52]:
df.iloc[[2,0],[2,0]]

   Marks  Roll_no
2    390      103
0    349      101

In [53]:
df

   Roll_no   Name  Marks  marks  loc
0      101   sonu    349  850.0    1
1      202  montu    789    c22    a
2      103  rahul    390    NaN  500
4      303  gudda    670    c12  c21

In [54]:
df.loc[(4,2,0),('marks','Roll_no')]

   marks  Roll_no
4    c12      303
2    NaN      103
0  850.0      101

In [55]:
df.iloc[[2,3,0],[2,0]]

   Marks  Roll_no
2    390      103
4    670      303
0    349      101

In [56]:
#Select only those rows where Marks>=700
df[df.Marks>=700]

   Roll_no   Name  Marks marks loc
1      202  montu    789   c22   a

In [57]:
#Select only those rows where Marks<=700 & loc is c21
df[(df.Marks<700) & (df['loc']=='c21')]

   Roll_no   Name  Marks marks  loc
4      303  gudda    670   c12  c21

In [58]:
#Select only those rows where Marks<=700 & loc is c21
df[(df['Marks']<700) & (df['loc']=='c21')]# <---------------------------

   Roll_no   Name  Marks marks  loc
4      303  gudda    670   c12  c21

# Lecture - 3

In [59]:
import pandas
# df=pd.read_excel('c:/Users/pankaj/aditya_sir_dataset/data_analysis/movies_sheets.xls',
#              sheet_name='1900s')
#df=pd.read_excel('c:/Users/pankaj/aditya_sir_dataset/data_analysis/movies_sheets.xls',
#              sheet_name=0)
df=pd.read_excel('c:/aditya_sir_dataset/data_analysis/movies_sheets.xls',
            nrows=20)
df

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 1.0.0 for Excel support Use pip or conda to install xlrd.

In [ ]:
df.shape

In [ ]:
df=pd.read_excel('c:/aditya_sir_dataset/data_analysis/movies_sheets.xls',
            header=None)
df

In [ ]:
df_list=pd.read_html('c:/aditya_sir_dataset/data_analysis/test.html')
#It returns a list of DataFrame
#It also fetch the data from the internet

In [ ]:
len(df_list)

In [ ]:
df_list[0]

In [ ]:
df_list[1]

# Fetching the data from the internet using pd.read_html()

In [ ]:
import pandas as pd
url = 'https://www.bbc.com/news/world-51235105'
df_list = pd.read_html(url)

In [ ]:
len(df_list)

In [ ]:
df_list[0]

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes.txt')

In [ ]:
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes1.txt'
               ,delimiter=':')

In [ ]:
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes2.txt'
               ,delimiter='\t')

In [ ]:
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes3.txt'
               ,delimiter=',')

In [ ]:
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes3.csv')

In [ ]:
df

# Lecture - 4

# JSON

JSON(JavaScript Object Notation)
>It represents data in key:value pair(like dictionary in python)
>JSON is used to talk to any language,with help of it we can use any 
    variable of any language to desired language.
JSON Array:
    >It is a list of json objects.
JSON Object:
    >It is a pair of key:value pair.
    >A JOSN object may contain 0-N key:value pairs
            {key1:value1,key1:value2,..}
[{},{},...{}]

# How JSON is related with Dataframe

Eack JSON object becomes row in DataFrame and keys of JSON object become
columns in DataFrame.

In [ ]:
import pandas as pd

In [ ]:
df=pd.read_json('c:/aditya_sir_dataset/data_analysis/students.json')
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/titanic.csv')
df

In [ ]:
df.shape

In [ ]:
df.Survived.isnull()

In [ ]:
df.Survived.isnull().sum()

In [ ]:
df.Cabin.isnull()

In [ ]:
df.Cabin.isnull().sum()#Cabin column has 687 missing values

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [ ]:
#How to find unique values in the column
df.Survived.unique()#It only gives the unique values

In [ ]:
df.Survived.value_counts()#It gives the unique values as well as corresponding
                          #frequencies of thata unique values

In [ ]:
df.gender

In [ ]:
df.gender.value_counts()

In [ ]:
df[df.Survived==1]

In [ ]:
df[df.Survived==1].gender.value_counts()

In [ ]:
df[df.Survived==0].gender.value_counts()#No.of male/female died

In [ ]:
df.Age.min()

In [ ]:
df.Age.max()

In [ ]:
df[df.Age<=10].shape

In [ ]:
df[df.Age<=10].Survived.value_counts()

In [ ]:
df[df.Age>=60].Survived.value_counts()

## Movies Dataset

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/movies.csv')
df

In [ ]:
df.shape

In [ ]:
df.ndim

In [ ]:
df.columns

In [ ]:
df.star_rating.min()

In [ ]:
df.star_rating.max()

In [ ]:
df.category.value_counts()

In [ ]:
df[df.category=='Drama'].star_rating.mean()

In [ ]:
df.category.unique()

In [ ]:
print('Average Duration')
for i in df.category.unique():
    avg=df[df.category==i].duration.mean()
    print(i,avg,sep='---------->')

In [ ]:
df.columns

In [ ]:
df[df.actors_list.str.contains('khan',case=False)]

In [ ]:
df[df.actors_list.str.contains('Amir Khan',case=False)].star_rating.mean()

# How to merge multiple dataset into a single dataset

In [ ]:
df1=pd.read_excel('c:/aditya_sir_dataset/data_analysis/movies_sheets.xls',
                sheet_name=0)
df2=pd.read_excel('c:/aditya_sir_dataset/data_analysis/movies_sheets.xls',
                sheet_name=1)
df3=pd.read_excel('c:/aditya_sir_dataset/data_analysis/movies_sheets.xls',
                sheet_name=2)

In [ ]:
df1.shape

In [ ]:
df2.shape

In [ ]:
df3.shape

In [ ]:
df1.columns==df2.columns

In [ ]:
df2.columns==df3.columns

In [ ]:
final_df=df1.append(df2,ignore_index=True)
final_df=final_df.append(df3,ignore_index=True)

In [ ]:
final_df

In [ ]:
final_df.shape

### Saving the file into the memory

In [ ]:
final_df.to_excel('c:all_movies.xlsx',index=False)#index=False means it will not save the index no. in the dataset

In [ ]:
pwd

# Lecture-5

#### Remaining topics in pandas

>EDA
>Data cleaning
>Data Encoding`

EDA(Exploaratory Data Analysis):
    It is a statistical way to perform primary investigation on data before
    going detailed study.
    >It provides various statitical characeristics of data like:
        >mean
        >mode
        >median
        >max
        >min
        >std
        >etc.
>We may also visualise EDA using matplotlib & seaborn libraries.
>In pandas ,we have following methods to  perform EDA:
        >info()
        >describe()
        >groupby()
        >etc.

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/tips.csv')
df

In [ ]:
df.info()

In [ ]:
df.describe()#It gives most common statistical charactristics of numeric columns

In [ ]:
#In above output 50% means median
#And 25%,50% and 75% are called quarter i.e quarter 1,quarter 2 and quarter 3.

In [ ]:
df.describe(include='all')#It will give all columns details

In [ ]:
df.groupby('gender').mean()

In [ ]:
df.groupby('gender').std()

In [ ]:
df.groupby('day').mean()

In [ ]:
df.groupby('day').mean()

In [ ]:
df.groupby(['day','gender']).mean()

In [ ]:
df.groupby(['day','gender']).std()

In [ ]:
df.groupby(['day','gender'])['total_bill'].count()

In [ ]:
df.groupby(['day','gender'])['total_bill','tip'].std()

## Data Preproccessing

>Handling Missing Values
>Handling duplicacy
>Data Cleaning
>Data Encoding

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/weather_data.txt')
df

In [ ]:
df.isnull()

In [ ]:
df.isnull().sum()

In [ ]:
df.fillna(20)#Filling missing values by 20

In [ ]:
df.fillna({'temperature':f'missing values : {df.temperature.mean()}'})
#Filling only temperature value with own value

In [ ]:
df.fillna({'temperature':df.temperature.mean(),'windspeed':df.windspeed.mean(),'event':'no_event'})

In [ ]:
df

In [ ]:
df.ffill()#It will fill farward value to next missing values#

In [ ]:
df

In [ ]:
df.bfill()#It will fill to backward missing value to backward value

In [ ]:
df

In [ ]:
df.dropna()#It will delete that row in which any row having atleast  single 
           #missing values
           #By default it works axis==0,means along the row

In [ ]:
df.dropna(axis=1)#along the column same as above

In [ ]:
df.dropna(thresh=2)#It will delete that row which is having tomost 2 non-missing value in the row

In [ ]:
df.dropna(thresh=2,axis=1)

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/weather_data2.txt')
df

In [ ]:
df.shape

In [ ]:
df

In [ ]:
df.drop_duplicates()

In [ ]:
df.drop_duplicates(inplace=True)
df

In [ ]:
 df.isnull().sum()

In [ ]:
df.temperature.max()

In [ ]:
df.temperature.min()

In [ ]:
df.replace({'temperature':-99999},30,inplace=True)

In [ ]:
df

In [ ]:
df.replace({'windspeed':[-99999,-88888]},10,inplace=True)
df

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/weather_data3.txt')
df

In [ ]:
df.replace({'temperature':'[\D]'},'',regex=True,inplace=True)
df

In [ ]:
df.replace({'windspeed':'[\D]'},'',regex=True,inplace=True)
df

In [ ]:
df.replace({'even':'[^a-zA-Z]'},'',regex=True,inplace=True)
df

Types of data:
    >Numeric
    >Categorical:
        1.ordinal
        2.nominal

In [ ]:
df=pd.read_csv('c:/aditya_sir_dataset/data_analysis/clothes.txt')
df

#Data encoding ===>converting categorical data to numeric
    >Label encoding(ordinal to numeric)
    >1-hot encoding(nominal to numeric)

In [ ]:
df

In [ ]:
df['size']=df['size'].map({'small':0,'medium':1,'large':2})
df

In [ ]:
df=pd.get_dummies(df)#1-hot encoding
df